// Представьте себе ситуацию: у нас есть группа студентов, и мы хотим отследить, кто из них посетил какие уроки и кто из преподавателей вёл данные уроки. 
// Map будет использоваться для хранения соответствия между уроком и преподавателем.
// Set будет использоваться для хранения уникальных уроков, которые посетил каждый студент.


let lessons = new Map();
// 1. Map: урок => преподаватель   ("Математика", "Смирнов"), ("История", "Иванова")
lessons.set("Математика", "Смирнов");
lessons.set("История", "Иванова");
lessons.set("Физика", "Михалченко")

let ivan = new Set();
// 2. Map: студент => Set уроков
ivan.add("Математика");
ivan.add("Физика");

let students = new Map();
students.set("Иван", ivan);
// Проверка:
console.log(`Преподаватель по Математике: ${lessons.get("Математика")}`); // Смирнов
console.log(`Уроки Ивана: ${[...students.get('Иван')]}`);